//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

//*************************************************************************
//<AMI_FHDR_START>
//
// Name:	AcpiPlatform.uni
//
// Description:	AcpiPlatform setup string definitions
//
//<AMI_FHDR_END>
//*************************************************************************

/=#
#include "VFR.uni"
        
#string STR_ACPIPLATFORM_FORM                   #language eng "Platform Misc Configuration"
#string STR_ACPIPLATFORM_FORM_HELP              #language eng "Platform Misc Configuration"

#string STR_ACPI_PCIE_NATIVE_PROMPT             #language eng "Native PCIE Enable"
#string STR_ACPI_PCIE_NATIVE_HELP               #language eng "PCI Express Native Support Enable/Disable. This feature is only available in Vista."

#string STR_NATIVE_ASPM_PROMPT                  #language eng "Native ASPM"
#string STR_NATIVE_ASPM_HELP                    #language eng "On enable, Vista will control the ASPM support for the device. If disabled, the BIOS will."

#string STR_ACPIDEBUG_PROMPT                    #language eng "ACPI Debug"
#string STR_ACPIDEBUG_HELP                      #language eng "Open a memory buffer for storing debug strings.Use method ADBG to write strings to buffer."

#string STR_PTID_PROMPT                         #language eng "PTID Support"
#string STR_PTID_HELP                           #language eng "PTID SSDT table will be loaded if enabled."

#string STR_RTD3_PROMPT                         #language eng "RTD3 Support"
#string STR_RTD3_HELP                           #language eng "RTD3 SSDT table will be loaded if enabled."

#string STR_VRSTAGGERINGDELAY_PROMPT            #language eng "VR Staggering delay"
#string STR_VRSTAGGERINGDELAY_HELP              #language eng "Delay between subsequent VR power on to avoid current spike"

#string STR_VRRAMPUPDELAY_PROMPT                #language eng "VR Ramp up delay"
#string STR_VRRAMPUPDELAY_HELP                  #language eng "Delay between subsequent VR ramp ups if they are all Turn ON at the same time"

#string STR_RTD3P0DL_PROMPT                     #language eng "PCIE Slot Device Power-on"
#string STR_RTD3P0DL_HELP                       #language eng "Delay between applying core power and Deasserting PERST#"

#string STR_RTD3P3DL_PROMPT                     #language eng "PCIE Slot Device Power-off"
#string STR_RTD3P3DL_HELP                       #language eng "Delay after removing Core power"

#string STR_RTD3AUDIO_PROMPT                    #language eng "Audio Delay"
#string STR_RTD3AUDIO_HELP                      #language eng "Delay after applying power to HD Audio(Realtek) codec device."

#string STR_RTD3ADSP_PROMPT                     #language eng "ADSP Delay"
#string STR_RTD3ADSP_HELP                       #language eng "Delay after applying power to ADSP device."

#string STR_RTD3I2C0_PROMPT                     #language eng "I2C0 Controller"
#string STR_RTD3I2C0_HELP                       #language eng "Delay in _PS0 I2C0 Controller after VR Ramp delay has elapsed."

#string STR_RTD3SENSORHUB_PROMPT                #language eng "SensorHub"
#string STR_RTD3SENSORHUB_HELP                  #language eng "Delay after applying power to SensorHub device after VR Ramp delay has elapsed."

#string STR_RTD3I2C1_PROMPT                     #language eng "I2C1 Controller"
#string STR_RTD3I2C1_HELP                       #language eng "Delay in _PS0 I2C1 Controller after VR Ramp delay has elapsed."

#string STR_RTD3I2C1PS0_PROMPT                  #language eng "TouchPad"
#string STR_RTD3I2C1PS0_HELP                    #language eng "Delay after applying power to TouchPad device after VR Ramp delay has elapsed."

#string STR_RTD3TOUCHPANEL_PROMPT               #language eng "TouchPanel"
#string STR_RTD3TOUCHPANEL_HELP                 #language eng "Delay after applying power to TouchPanel device after VR Ramp delay has elapsed."

#string STR_PEPGFX_PROMPT                       #language eng "  PEP Gfx Support"
#string STR_PEPGFX_HELP                         #language eng "RTD3 PEP device support."

#string STR_PEPSATA_PROMPT                      #language eng "  PEP Sata Support"
#string STR_PEPSATA_HELP                        #language eng "RTD3 PEP device support."

#string STR_PCAPPING_PROMPT                     #language eng "P-state Capping"
#string STR_PCAPPING_HELP                       #language eng "Set _PPC and send ACPI notification."

#string STR_XHCIP0_PROMPT						#language eng "USB Port 1"
#string STR_XHCIP1_PROMPT						#language eng "USB Port 2"
#string STR_XHCIP_HELP							#language eng "USB RTD3 support."
#string STR_HIGHSPEED							#language eng "High Speed"
#string STR_SUPERSPEED							#language eng "Super Speed"

#string STR_RIC0_PROMPT                      	#language eng "I2C0 Sensor Hub"
#string STR_RIC0_HELP        	                #language eng "Enable RTD3 support for I2C0 Sensor Hub"

#string STR_RTD3_ZPODD_PROMPT                  	#language eng "ZPODD"
#string STR_RTD3_ZPODD_HELP        	            #language eng "Zero Power ODD option is applicable only for WhiteTipmountain1 with ZPODD Feature rework."

#string STR_RTD3_USBCAMERA_PROMPT              	#language eng "USB Camera"
#string STR_RTD3_USBCAMERA_HELP                 #language eng "USB Camera option is applicable only for WhiteTipmountain1 and Sawtoothpeak with USB Camera Feature rework."

#string STR_RTD3_MINISATAPORT3_PROMPT          	#language eng "MiniCard SATA Port3"
#string STR_RTD3_MINISATAPORT3_HELP             #language eng "MiniCard SATA Port3."
#string STR_1_5_DK                              #language eng "1.5DK MiniCard"
#string STR_3_3_DK                              #language eng "3.3DK MiniCard"

#string STR_RTD3_RTD3WAGPIO_PROMPT          	#language eng "WA GPIO"
#string STR_RTD3_RTD3WAGPIO_HELP                #language eng "Steal RTD3 GPIO 77 from SDHC device and use for a PCIE slot."
#string STR_SLOT_1                              #language eng "SLOT 1"
#string STR_SLOT_6                              #language eng "SLOT 6"

#string STR_PECI_ACCESS_PROMPT                  #language eng "PECI Access Method"
#string STR_PECI_ACCESS_HELP                    #language eng "PECI Access Method is Direct I/O or ACPI"
#string STR_PECI_ACCESS_IO                      #language eng "Direct I/O"
#string STR_PECI_ACCESS_ACPI                    #language eng "ACPI"

#string STR_POWERBUTTON10SECOVR_PROMPT          #language eng "10Sec Power Button OVR"
#string STR_POWERBUTTON10SECOVR_HELP            #language eng "Enable/Disable 10Sec Power Button Override feature. When enabled, Power button must be pressed for 10 seconds to cause an unconditional S5 transition(Power Button Override)."

#string STR_LOWPOWERIDLESATA_PROMPT             #language eng "Low Power Idle SATA Constraint"
#string STR_LOWPOWERIDLESATA_HELP               #language eng "Select lower power idle constraint: None, Ports or Controller"
#string STR_NOCONSTRAINT                        #language eng "No Constraint"
#string STR_SATAPORTS                           #language eng "SATA Ports"
#string STR_SATACONTROLLER                      #language eng "SATA Controller"

#string STR_ECNOTIFICATION_PROMPT               #language eng "EC Notification"
#string STR_ECNOTIFICATION_HELP                 #language eng "Sends EC notification of Low Power S0 Idle State"

#string STR_ECCSDEBUGLIGHT_PROMPT               #language eng "EC CS Debug Light"
#string STR_ECCSDEBUGLIGHT_HELP                 #language eng "When EC enters Low Power S0 Idle State, the CAPS LOCK light will be turned on"

#string STR_SENSORSTANDBY_PROMPT                #language eng "Sensor Standby"
#string STR_SENSORSTANDBY_HELP                  #language eng "Enable/Disable Sensor standby mode"

#string STR_CSPL1LIMIT_PROMPT                   #language eng "CS PL1 Limit"
#string STR_CSPL1LIMIT_HELP                     #language eng "Limit PL1 (Power Limit 1) while in Connected Standby"

#string STR_CSPL1VALUE_PROMPT                   #language eng "CS PL1 Value"
#string STR_CSPL1VALUE_HELP                     #language eng "PL1 value is in milliwatts with 125 step value"

#string STR_ENABLE_CPPC_PROMPT                  #language eng "ACPI 5.0 CPPC Support"
#string STR_ENABLE_CPPC_HELP                    #language eng "Enable ACPI 5.0 Collaborative Control (CPPC) support. When Enabled, Platform exposes CPPC interfaces to Operating System. When Disabled, Platform exposes legacy (non-CPPC) proessor interfaces to Operating System."
#string STR_ENABLE_CPPC_SCI_PROMPT              #language eng "  ACPI 5.0 CPPC Platform SCI"
#string STR_ENABLE_CPPC_SCI_HELP                #language eng "Enable ACPI 5.0 platform generation of SCI on CPPC command completion. When Enabled, Platform generates GPE/SCI. When Disabled. Platform does not generate GPE/SCI and OS polls for command completion."

//=======================================================================//
//                                 DPTF                                  //
//=======================================================================//
#string STR_DPTF_CONFIG_FORM_TITLE              #language eng "DPTF Configuration"
#string STR_DPTF_CONFIG_FORM_HELP               #language eng "DPTF Configuration options"
#string STR_DPTF_POLICY_FORM_TITLE              #language eng "Policy Configuration"
#string STR_DPTF_POLICY_FORM_HELP               #language eng "Policy Configuration options"

#string STR_ENABLE_DPTF_PROMPT                  #language eng "DPTF"
#string STR_ENABLE_DPTF_HELP                    #language eng "Enable/Disable Intel Dynamic Platform Thermal Framework"
#string STR_DPTF_SA_PROMPT                      #language eng "Processor"
#string STR_DPTF_SA_HELP                        #language eng "Enable/Disable Processor Thermal Device."
#string STR_DPTF_PCH_PROMPT                     #language eng "PCH Thermal Device"
#string STR_DPTF_PCH_HELP                       #language eng "Enable/Disable PCH Thermal Device."
#string STR_DPTF_MEM_PROMPT                     #language eng "Memory Device"
#string STR_DPTF_MEM_HELP                       #language eng "Enable/Disable Memory Thermal Device."
#string STR_DPTF_AMBIENT_PROMPT                 #language eng "Ambient Device"
#string STR_DPTF_AMBIENT_HELP                   #language eng "Enable/Disable Ambient Thermal Device."
#string STR_DPTF_SKIN_PROMPT                    #language eng "Skin Device"
#string STR_DPTF_SKIN_HELP                      #language eng "Enable/Disable Skin Thermal Device."
#string STR_DPTF_EXHAUST_PROMPT                 #language eng "Exhaust Fan Device"
#string STR_DPTF_EXHAUST_HELP                   #language eng "Enable/Disable Exhaust Fan Thermal Device."
#string STR_DPTF_VR_PROMPT                      #language eng "VR Device"
#string STR_DPTF_VR_HELP                        #language eng "Enable/Disabl VR Thermal Device."

#string STR_DPTF_ATTP_PROMPT                    #language eng "  Active Thermal Trip Point"
#string STR_DPTF_ATTP_HELP                      #language eng "This value controls the temperature of the ACPI Active Thermal Trip Point."
#string STR_DPTF_PTTP_PROMPT                    #language eng "  Passive Thermal Trip Point"
#string STR_DPTF_PTTP_HELP                      #language eng "This value controls the temperature of the ACPI Passive Thermal Trip Point."
#string STR_DPTF_CTTP_PROMPT                    #language eng "  Critical Thermal Trip Point"
#string STR_DPTF_CTTP_HELP                      #language eng "This value controls the temperature of the ACPI Critical Thermal Trip Point."
#string STR_DPTF_HTTP_PROMPT                    #language eng "  Hot Thermal Trip Point"
#string STR_DPTF_HTTP_HELP                      #language eng "This value controls the temperature of the ACPI Hot Thermal Trip Point."

#string STR_DPTF_PPCC_PROMPT                    #language eng "  PPCC Step Size"
#string STR_DPTF_PPCC_HELP                      #language eng "Step size for Turbo power Limit (RAPL) control."
#string STR_DPTF_LPO_PROMPT                     #language eng "  CLPO Enable"
#string STR_DPTF_LPO_HELP                       #language eng "Instructs the policy to use Active Cores if they are available."
#string STR_DPTF_LPOPSTATE_SEL                  #language eng "  CLPO Start PState"
#string STR_DPTF_LPOPSTATE_SEL_HELP             #language eng "Instructs the policy when to initiate Active Core control if enabled. Note: 16=LFM."
#string STR_DPTF_LPOSIZE_SEL                    #language eng "  CLPO Step size"
#string STR_DPTF_LPOSIZE_SEL_HELP               #language eng "Instructs the policy to take away logical processores in the specified percentage steps."
#string STR_DPTF_LPOPOW_PROMPT                  #language eng "  CLPO Power Control"
#string STR_DPTF_LPOPOW_HELP                    #language eng "Instructs the policy whether to use Core offlining or SMT offlining if Active core control is enabled to be used in P0 or when power control is applied."
#string STR_DPTF_LPOPER_PROMPT                  #language eng "  CLPO Performance Control"
#string STR_DPTF_LPOPER_HELP                    #language eng "Instructs the policy whether to use Core offlining or SMT offlining if Active core control is enabled to be used in P1 or when performance control is applied."

#string STR_DPTF_CTDP_PROMPT                  #language eng "  Config TDP"
#string STR_DPTF_CTDP_HELP                    #language eng "Enable/Disable Config TDP."



#string STR_DPTF_LPM_PROMPT                     #language eng "  LPM"
#string STR_DPTF_LPM_HELP                       #language eng "Enable/Disable Intel Low Power Mode"
#string STR_DPTF_LPM_SETTING_PROMPT             #language eng "    CLPM"
#string STR_DPTF_LPM_SETTING_HELP               #language eng "Current Low Power Mode Setting."
#string STR_DPTF_FAN1_PROMPT                    #language eng "FAN1 Device"
#string STR_DPTF_FAN1_HELP                      #language eng "Enable the Fan1 device."
#string STR_DPTF_FAN2_PROMPT                    #language eng "FAN2 Device"
#string STR_DPTF_FAN2_HELP                      #language eng "Enable the Fan2 device."
#string STR_DPTF_FULL_GEN_PARTICIPANT_PROMPT    #language eng "Full Generic participant"
#string STR_DPTF_FULL_GEN_PARTICIPANT_HELP      #language eng "Enable/Disable the Full Generic participant."
#string STR_DPTF_DISPLAY_PARTICIPANT_PROMPT     #language eng "Display participant"
#string STR_DPTF_DISPLAY_PARTICIPANT_HELP       #language eng "Enable/Disable the Display participant."
#string STR_DPTF_WIFI_PARTICIPANT_PROMPT        #language eng "Wifi participant"
#string STR_DPTF_WIFI_PARTICIPANT_HELP          #language eng "Enable/Disable the Wifi participant."
#string STR_DPTF_POWER_PARTICIPANT_PROMPT       #language eng "Power participant"
#string STR_DPTF_POWER_PARTICIPANT_HELP         #language eng "Enable/Disable the Power participant."
#string STR_DPTF_POWER_POLICY_PROMPT            #language eng "Power Policy"
#string STR_DPTF_POWER_POLICY_HELP              #language eng "Enable/Disable the Power Policy."

#string STR_DPTF_ACTIVE_POLICY_PROMPT           #language eng "Acitve Policy"
#string STR_DPTF_ACTIVE_POLICY_HELP             #language eng "Enable/Disable Active Policy."
#string STR_DPTF_PASSIVE_POLICY_PROMPT          #language eng "Passive Policy"
#string STR_DPTF_PASSIVE_POLICY_HELP            #language eng "Enable/Disable Passive Policy."
#string STR_DPTF_CRITICAL_POLICY_PROMPT         #language eng "Critical Policy"
#string STR_DPTF_CRITICAL_POLICY_HELP           #language eng "Enable/Disable Critical Policy."
#string STR_DPTF_COOLING_POLICY_PROMPT          #language eng "Cooling Mode Policy"
#string STR_DPTF_COOLING_POLICY_HELP            #language eng "Enable/Disable Cooling Mode Policy."
#string STR_DPTF_TRT_PROMPT                     #language eng "  TRT Revision"
#string STR_DPTF_TRT_HELP                       #language eng "Select the TRT influence."

#string STR_DPTF_PPCC_OBJECT_PROMPT             #language eng "PPCC Object"
#string STR_DPTF_PPCC_OBJECT_HELP               #language eng "Enable/Disable PPCC object for validation."
#string STR_DPTF_PEGN_OBJECT_PROMPT             #language eng "FGEN _TMP Object"
#string STR_DPTF_PGEN_OBJECT_HELP               #language eng "Enable/Disable Full Generic _TMP object for validation."
#string STR_DPTF_VR_OBJECT_PROMPT               #language eng "VR   _TMP Object"
#string STR_DPTF_VR_OBJECT_HELP                 #language eng "Enable/Disable VR _TMP object for validation."
#string STR_DPTF_TSKN_OBJECT_PROMPT             #language eng "TSKN _TMP Object"
#string STR_DPTF_TSKN_OBJECT_HELP               #language eng "Enable/Disable SKIN sensor _TMP object for validation."
#string STR_DPTF_TMEM_OBJECT_PROMPT             #language eng "TMEM _TMP Object"
#string STR_DPTF_TMEM_OBJECT_HELP               #language eng "Enable/Disable Memory _TMP object for validation."
#string STR_DPTF_TEFM_OBJECT_PROMPT             #language eng "TEFN _TMP Object"
#string STR_DPTF_TEFM_OBJECT_HELP               #language eng "Enable/Disable Exhaust Fan _TMP object for validation."
#string STR_DPTF_TAMB_OBJECT_PROMPT             #language eng "TAMB _TMP Object"
#string STR_DPTF_TAMB_OBJECT_HELP               #language eng "Enable/Disable Ambient sensor _TMP object for validation."
#string STR_DPTF_TCPU_OBJECT_PROMPT             #language eng "TCPU _TMP Object"
#string STR_DPTF_TCPU_OBJECT_HELP               #language eng "Enable/Disable CPU _TMP object for validation."
#string STR_DPTF_B0D4_OBJECT_PROMPT             #language eng "B0D4 _TMP Object"
#string STR_DPTF_B0D4_OBJECT_HELP               #language eng "Enable/Disable Procesor _TMP object for validation."
#string STR_DPTF_OPTIONAL_OBJECT_PROMPT         #language eng "Optional Object"
#string STR_DPTF_OPTIONAL_OBJECT_HELP           #language eng "Enable/Disable PIPR/PAPR for processor participant."

#string STR_15_C                                #language eng "15 C"
#string STR_23_C                                #language eng "23 C"
#string STR_31_C                                #language eng "31 C"
#string STR_39_C                                #language eng "39 C"
#string STR_47_C                                #language eng "47 C"
#string STR_55_C                                #language eng "55 C"
#string STR_63_C                                #language eng "63 C"
#string STR_71_C                                #language eng "71 C"
#string STR_79_C                                #language eng "79 C"
#string STR_87_C                                #language eng "87 C"
#string STR_95_C                                #language eng "95 C"
#string STR_103_C                               #language eng "103 C"
#string STR_111_C                               #language eng "111 C"
#string STR_119_C                               #language eng "119 C"

#string STR_DPTF_ENABLE_SA_TD                   #language eng "SA Thermal Device"
#string STR_DPTF_ENABLE_CPU_TD                  #language eng "CPU Thermal Device"
#string STR_05_W                                #language eng "0.5 Watts"
#string STR_10_W                                #language eng "1.0 Watts"
#string STR_15_W                                #language eng "1.5 Watts"
#string STR_20_W                                #language eng "2.0 Watts"
#string STR_SMT_OFFLINING                       #language eng "SMT Off lining"
#string STR_CORE_OFFLINING                      #language eng "Core Off lining"
#string STR_LPM_DISABLED                        #language eng "Disable LPM"
#string STR_LPM_ENABLED                         #language eng "Enable LPM"
#string STR_LPM_APPLI_SPEC                      #language eng "Application Specific LPM"
#string STR_LPM_USE_OS                          #language eng "Use the LPM setting as requested by the OS"
#string STR_TRT_TRADITIONAL                     #language eng "Traditional"
#string STR_TRT_PRIORITY                        #language eng "Priority"

#string STR_IRMT_PROMPT                         #language eng "Intel Ready Mode Technologh Support"
#string STR_IRMT_HELP                           #language eng "Intel RMT SSDT table will be loaded if enabled."
#string STR_IRMT_STATE_PROMPT                   #language eng "  Intel RMT State"
#string STR_IRMT_STATE_HELP                     #language eng "Intel RMT Enabling Status in BIOS."
#string STR_IRMT_HW_PROMPT                      #language eng "  HW Notification"
#string STR_IRMT_HW_HELP                        #language eng "Hardware notification enabling status."

//#string <string name>                   #language eng ""
//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
//*************************************************************************